# Area Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..Area Property
Zone Class See Also
---
Get the Area of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Area { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Area As Double
	Get
```

Visual C++
---
```text
public:
property double Area {
	double get ();
}
```

# Remarks
This property is used to get the Area of the Zone.
# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace